anchors = [
    # 师门任务
    # (10099, ["日常-师门任务", "日常-师门赐教","日常-师门历练", "师门-修习试炼", "师门-扬名立万", "去完成", "价格较高请自行购买"]),

    # 宝图任务
    (10088, ["听听无妨", "日常-宝图任务"]),

    (2, ["跳过剧情动画", "跳过剧懵~画", "通关", "加为好友"]),
    (0, ["进入战斗", "迸入战斗", "日常-捉鬼", "曰常-捉鬼", "捉鬼任务", "白晓仙子"]),
    (1, ["噩梦浮现", "副本已完成", "副本己完咸"]),
    (3, ["选择副本"]),
    (4, ["果断出手", "陷入噩梦"]),  # 左下角 黄框
    (6, ["秘境降妖"]),

    # 二重影-侠士
    (10, ["与六耳切磋", "六耳大脑方寸山", "从菩提祖师手中救下六", ]),

    # 掏海去-普通
    (12, ["龙王之怒", "偷习秘法", "搅海弄云", "搅海舜云"]),

    # 琉璃碎-普通
    (14, ["琉璃生性羞怯", "卷帘的挣扎", "争执", ]),

    # 明珠还-普通
    (16, ["心性试炼", "天庭来拿", "天庭来r", "天庭来享", "火烧明珠", "天庭来辜", ]),

    # 明珠还-侠士
    (3, ["地府相会", "击败恶龙", "天命如何"]),

    # 绿烟如梦-侠士
    (18, ["不行 !", "好重的杀气"]),
    (19, ["打败康太尉", "打败魔化康太尉", "阻止嫦娥"]),

    # 桃花定情-侠士
    (20, ["不要被他蛊惑 !", "怎么又是你 !", "休得无礼", "小心", "小心 !"]),
    (21,
     ["打败九宫心魔", "意外遇到福陵老妖", "蕙外遇到褐陵老妖", "遇到拦路妖怪", "打败魔化福陵老妖", "打败赝化褐凌老妖",
      "打败厦化褐陵老妖"
      "战胜孟婆", "战胜孟窭"]),

    # 金蝉心-普通
    (23, ["同门相争", "回门相争", "清者自清", "金蝉之力", "金蝉2力"]),

    # 流沙净-普通
    (23, ["袭人妖怪", "少女不愿意嫁人", "少女不愿匮嫔人", "利刃相迎"]),

    (24, ["少侠已经捉完1轮鬼。是否继续捉鬼?"]),

    # 绿烟如梦-普通
    (23, ["绿烟仙子现身", "康太尉诬陷天蓬调戏嫦", "天兵捉拿天蓬", "天兵捉挛天莲"]),

    # 桃花定情-普通
    (23, ["打败鬼将", "打败鬼格", "打败孟婆", "帮助猪八戒", "打败福陵老妖", "打败褐陵老妖"]),

    # 琉璃碎-侠士
    (14, ["蛊惑失败", "蛊惑失效", "求而不得的过去", "打碎琉璃盏"]),

    # 流沙净-侠士
    (14, ["被撞破的妖魔", "决裂", "逼问妖魔下落", ]),

    # 流沙净-普通
    (14, ["击败恼人的猢狲们", "击败水帘洞灵", "六耳与石猴大打出手"]),

    # 流沙净-普通
    (14, ["师徒过招", "击败恶虎寅将军", "从虎寅将军手里救下小猴"]),

    # 蹈海去-侠士
    (14, ["挣脱梦赝", "挣脱梦魇", "攘除贼寇", "渔港境", ]),

    # 金蝉心-侠士
    (23, ["谈判失败", "五行禁地", "师徒之争"]),

    # 西行-侠士
    (23, ["自我证明", "大圣报恩", "心魔难解", "金蝉之力", "金蝉2力"]),

    # 踏西行-普通

    (23, ["灵力苏醒", "超度万鬼", "真魔假皇", "真赓假皇"]),

    # 方丈山-侠士
    (8, ["再战阎罗王", "老龙王的愤怒", "我命由我不由天"]),

]
certain_coordinate_windows = {
    "百晓仙子": [[560, 517], [646, 530]],
    "郑镖头": [[326, 579], [384, 588]],

    "店小二": [[962, 517], [1020, 534]],
    "钟馗": [[476, 564], [517, 579]],

    "侠士副本": [[513, 190], [686, 229]],
    "侠士1": [[411, 773], [573, 822]],
    "侠士2": [[767, 776], [933, 822]],
    "普通副本": [[300, 188], [472, 224]],
    "普通1": [[411, 773], [573, 822]],
    "普通2": [[767, 776], [933, 822]],
    "普通3": [[1124, 773], [1289, 821]],
    "选择副本": [[1195, 443], [1528, 488]],

    "活动": [[417, 77], [478, 129]],

    # 小地图
    "打开小地图": [[130, 69], [270, 142]],

    "队伍": [[1468, 201], [1591, 253]],
    "任务": [[1345, 201], [1465, 253]],
    "队伍头像": [[1307, 285], [1365, 346]],
    "离开队伍": [[1104, 387], [1244, 452]],
    "世界地图": [[17, 69], [92, 147]],
    "长安城": [[703, 538], [839, 602]],
    "东海湾": [[1206, 551], [1292, 614]],

    "押送普通镖银": [[1197, 527], [1534, 572]],
    "押送高级镖银(有难度": [[1190, 609], [1531, 656]],
    "云乐游": [[652, 542], [719, 559]],
    "云乐游秘境降妖": [[1197, 360], [1526, 405]],
    "瑶池仙镇进入": [[373, 826], [592, 867]],
    "继续挑战": [[1268, 795], [1339, 870]],
    "确定": [[855, 571], [1019, 618]],
    # 快捷点击
    "快速应战": [[1232, 608], [1484, 657]],
    "师门任务完成确认": [[683, 763], [923, 805]],
    "退出师门任务界面": [[1392, 228], [1412, 242]],
    "确认捉鬼": [[865, 554], [1016, 599]],

    # not remark

    "购买": [[625, 488], [725, 510]],

    # up

    "创建队伍": [[364, 310], [437, 354]],
    "关闭队伍": [[364, 310], [437, 354]],
    "消息": [[364, 310], [437, 354]],
    "世界频道": [[364, 310], [437, 354]],
    "gangsChannel": [[364, 310], [437, 354]],
    "输入框": [[364, 310], [437, 354]],
    "sendMessage": [[364, 310], [437, 354]],
    "closeMessage": [[364, 310], [437, 354]],
    "接受": [[364, 310], [437, 354]],

}
